Repository: giellalt/corpus-nob
Catalog: prestable/tmx/sme/facta/skuvlahistorja6/romsasami-n.html.tmx
Source language: nob
Languages: sme

source: Artikkel i boka Samisk skolehistorie 6.
sme: Artihkal girjjis Sámi skuvlahistorjá 6.

source: Sameskolen i Troms
sme: Tromssa sámeskuvla

source: Sameskolen i Troms (Foto: Svein Lund)
sme: Tromssa sámeskuvla (Govva: Svein Lund)

source: Samene i Norge bor over hele landet.
sme: Norggabeal sápmelaččat orrot miehtá riikka.

source: De fleste stedene utenfor samisk forvaltningsområde er det ikke så bra skoletilbud, sjøl om opplæringslova sier at hver samisk elev som krever opplæring i samisk, skal få det.
sme: Eanáš guovlluin sámi hálddašanguovllu olggobealde ii leat nu buorre skuvlafálaldat, vaikko oahppolága mielde galgá sámegielfálaldat juohke sámi oahppái gii dan gáibida.

source: Men i indre Troms er det egen sameskole, Tromssa sámeskuvla, midt i den svært norskdominerte kommunen Målselv.
sme: Muhto sis-Romssas lea sierra sámeskuvla, garrasit dáruiduhtton guovllus Málatvuomis.

source: Det er en statlig skole, men det er Målselv kommune som fungerer som arbeidsgiver for skolens ansatte.
sme: Lea stáhta skuvla, muhto Málatvuomi suohkan lea skuvlabargiid bargoaddi.

source: Skolen har eget styre.
sme: Skuvllas lea sierra stivra.

source: Fortellinga om denne skolen sier kanskje mest av alt noe om hvor viktig det er å ha en god skole hvis man i dag skal klare å bevare språket.
sme: Muitalus skuvlla birra čilge várra buot eanemus man dehálaš skuvla lea dán áigge sámegiela seailluheames.

source: Vi har intervjua Berit Oskal Eira og Anne Oskal Rørslett. I tillegg har en tidligere elev, Anne Wuolab, skrevet om hvordan hverdagen på internat kan fortone seg.
sme: Mii leat jearahallan Berit Oskal Eiras ja Anne Oskal Rørslettas, Ja de lea vel ovddeš oahppis, Anne Wuolab, gii lea čállán teavstta mii muitala internáhtaorru eallimis.

source: Berit Oskal Eira: En annerledes internatskole
sme: Berit Oskal Eira: Earálágán internáhttaskuvla

source: Berit Oskal Eira på grunnsteinnedlegginga for Diehtosiida i Guovdageaidnu, 2007.
sme: Berit Oskal Eira Diehtosiidda vuođđogeađgebidjamis Guovdageainnus 2007.

source: Hun var da statssekretær for samiske saker.
sme: Son lei dalle sámi áššiid stáhtačállin.

source: (Foto: Svein Lund)
sme: (Govva: Svein Lund)

source: Berit Oskal Eira ble født i Karesuando i 1951, og vokste opp som reindriftssame i Tromsø.
sme: Berit Oskal Eira lea riegádan Gárasavvonis 1951:s ja lea bajásšaddán johttisápmelažžan Romssas.

source: Hun har gått grunnskole i Ramfjord og Kautokeino, videregående skoler både i Målselv, Narvik og Jokkmokk.
sme: Son lea vázzán vuođđoskuvlla Gáranasvuonas ja Guovdageainnus, ja joatkkaskuvllaid sihke Málatvuomis, Áhkkánjárggas ja Johkamohkis.

source: Hun har lest samisk grunnfag ved Samisk høgskole, og har tatt praktisk pedagogikk ved Universitetet i Tromsø.
sme: Son lea lohkan sámegiela vuođđofága Sámi allaskuvllas, ja lea váldán praktihkalaš pedagogalaš oahpu Romssa universitehtas.

source: Eira har jobba i reindrifta og med duodji, og har dessuten undervist med Sameskolen i Troms i fagene duodji og samisk.
sme: Eira lea bargan boazodoalus ja dujiin, ja dasa lassin lea oahpahan Tromssa sámeskuvllas duoji ja sámegiela.

source: Hun har også arbeidet med forskjellige ting for Norske Reindriftssamers Landsforbund.
sme: Son lea maid bargan iešguđetlágan bargguid Norgga Boazosápmelaččaid Riikkasearvvi ovddas.

source: I tillegg har hun som politiker deltatt i mye viktig arbeid, sånn som det andre samerettsutvalget, samisk parlamentarisk råd og som sametingsrepresentant i perioden 2001–09.
sme: Dasa lassin son lea politihkkárin oassálastán máŋgga dehálaš barggus, nu mo nuppi Sámiid vuoigatvuođalávdegottis, Sámi parlamentáralaš ráđis ja son lei sámediggeáirras 2001–09.

source: Hun var statssekretær for samiske- og minoritetssaker 2005–07.
sme: Son lei sámi ja unnitloguid áššiid stáhtačálli 2005-07.

source: Eira har også være sameskolens styreleder på 1980- og 90-tallet.
sme: Eira lea maid leamaš Tromssa sámeskuvlla stivrajođiheaddji 1980- ja 90-loguin.

source: Hun bor på Fossbakken i Lavangen kommune.
sme: Son orru Ruŋgogierragis Loabága suohkanis.

source: Sameskolens elevgrunnlag
sme: Tromssa sámeskuvlla oahppivuođđu

source: I 1950 flytta noen reindriftsfamilier fra Kautokeino til Troms.
sme: 1950 fárreje muhtun Guovdageainnu bádjeolbmot Romssa fylkii.

source: De bosatte seg i Stuoranjárga og Mauken reinbeitedistrikt, og noen bosatte seg seinere i Stálonjárga og Altevatn.
sme: Sii ásaiduvve Stuoranjárgii ja Meavkki orohahkii ja muhtumat ásaiduvve maŋŋel Stálonjárgii ja Álttesjávrái.

source: De hørte til Oskal slekta.
sme: Sii gulle Oskal-sohkii.

source: I løpet av 1960-årene flytta flere fra Kautokeino til Gielas og Frostisen reinbeitedistrikt, og noen kom til andre distrikter.
sme: 1960-jagiin fárrejedje vel guovdageaidnolaččat Giellasii ja Frostisen orohahkii, ja vel eará orohagaide.

source: Berit Oskal Eira var ikke født da familien hennes flytta til Troms fylke.
sme: Berit Oskal Eira ii lean riegádan go su bearaš fárrii Romssa fylkii.

source: – Hvordan kom dere på at dere ville bygge en egen skole for barna deres?
sme: – Mas bođii jurdda hukset sierra skuvlla din mánáid várás?

source: – Bakgrunnen for dette er at vi i vår generasjon hadde gått på internatskole i Masi og Kautokeino, det var langt hjemmefra.
sme: – Duogáš dasa lei ahte mii, min buolva, leimmet vázzán internáhtaskuvlla guhkkin eret ruovttus Mázes ja Guovdageainnus.

source: Vi ønsket at barna våre ikke skulle behøve å reise så langt.
sme: Mii háliideimmet ahte min mánát eai galgan dárbbašit nu guhkás mátkkoštit.

source: Foreldrene begynte å la barna sine gå på forskjellige skoler rundt omkring i nærmiljøene sine.
sme: Váhnemat álge bidjat mánáid skuvllaide feara gosa, gos ain orro.

source: Det var ett og to samisktalende barn på hver skole Det var ikke mulig å få samisk som fag på skolene.
sme: Ledje okta ja guokte sámegielat máná juohke skuvllas. Ii lean vejolašvuohta sámegiela oažžut skuvllain ge.

source: Og derfra oppsto tanken om at det skulle ha vært en egen skole.
sme: Ja dies dat čuožžilii dat jurdda ahte galggašii leat sierra skuvla.

source: Sånn at barna får undervisning på samisk, og også for å opprettholde språket.
sme: Nu ahte mánát ožžot sámegiela, ja maiddái nu ahte mii oažžut doalahit giela dáppe.

source: Det er ganske vanskelig når det er så få samisktalende på et sted.
sme: Lea oalle váttis gos nu unnán sámegielagat orrot ovtta sajis.

source: Lang og krevende prosess
sme: Guhkes ja moalkás proseassa

source: Vi begynte å jobbe med dette gjennom Troms Reindriftssamers fylkeslag i 1974.
sme: – Mii álggiimet Tromssa Boazosápmelaččaid Fylkasearvvis dainna bargat 1974:s.

source: Vi prøvde på alle mulige måter å få dette til.
sme: Mii barggaimet juohke ládje dan oažžut áigái.

source: Vi hadde utvalg som dro på møter med departementer og stortingskomiteer.
sme: Mis ledje lávdegottit ja mii čoahkkinasttiimet departemeanttaiguin ja stuoradiggelávdegottiiguin.

source: Til slutt klarte vi å få stortingskomiteen til å bevilge 3 millioner, slik at vi fikk starta opp skolen.
sme: Loahpas mii goit nagodeimmet ruđaid luvvet stuoradiggelávdegottis, 3 milliuvnna, nu ahte oaččuimet johtui dan skuvlla.

source: Dette var i 1983.
sme: Dat lei 1983:s.

source: Men før det fikk vi også penger fra skoledirektøren.
sme: Muhto dan ovdal oaččuimet maiddái skuvladirektevrras ruđaid.

source: Vi brukte å samle barna to uker, to ganger i året.
sme: Mii láviimet guovtti vahku guovtti geardde jagis čohkket mánáid.

source: Da underviste vi i samisk og litt kulturlære.
sme: Oahpaheimmet sámegiela ja veaháš kulturoahpu vel.

source: Dette gjorde vi i fire–fem år.
sme: Njeallje–vihtta jagi nie barggaimet.

source: vi pleide å leie på forskjellige steder, vi var på lokale campingplasser – Målselvfossen, Møllerhaugen eller Haraldvollen.
sme: Láviimet láigohit feara gos, leimmet báikkálaš campingsajiin – Målselvfossenis, Møllerhaugenis dahje Haraldvollenis.

source: Foreldrene fungerte som lærere – de var nok ikke lærere utdanna da, men det var de som kunne fungere som lærere.
sme: Oahpaheaddjin ledje váhnemat – eai lean várra dalle oahppan oahpaheaddjit, muhto ledje dakkárat mat dal dalle dohkkehuvvoje oahpaheaddjin.

source: Det var ikke så lett å få fri for barna fra de skolene som de gikk på til vanlig, for den tida de var borte derfra, kom de jo til å henge etter i andre fag, så dette med samlinger var ikke noen god løsning.
sme: Ii lean nu álki oažžut mánáid luovus dain skuvllain gos muđui vázze, go dan botta go ledje doppe eret, de bázáhalle fas eará fágain, ahte ii lean nu ge buorre čoavddus dát.

source: Men vi fikk jo skolen i gang omsider, i 1983, og da var vi på Haraldvollen fram til høsten 1997.
sme: Muhto viimmat 1983:s oaččuimet johtui skuvlla, ja de leimmet Haraldvollenis gitta 1997 čakčii.

source: Da flytta vi hit, til vår egen skole.
sme: Dalle fárriimet deike, iežamet skuvlii.

source: – Hvordan var det i den tida da skolen var kommet i gang, men dere fortsatt ikke hadde egne skolebygninger?
sme: – Mo lei dalle go skuvla lei boahtán johtui, muhto dis eai lean vel sierra skuvlavisttit?

source: Hvordan jobba dere politisk for å få til det?
sme: Mo dalle barggaidet politihkalaččat iežadet skuvlavistti fidnet?

source: – Vi måtte bare jobbe videre, fortsette møtevirksomheten.
sme: – Na, fertiimet viidásut ain bargat ja čoahkkinastit.

source: Vi fikk penger til å bygge noe på Haraldvollen, men der var det trangt, det var ikke mange klasserom.
sme: Dat ožžo ruđaid Haraldvollenis hukset skuvlla doppe, muhto dat lei maid gárži, eai dat lean galle oahppolanja.

source: Men det var en begynnelse.
sme: Muhto lei álgu.

source: Likevel var det behov for å få nye bygninger.
sme: Lei liikká dárbu ođđa visttiid oažžut.

source: Og vi var selvfølgelig veldig fornøyde da vi omsider fikk det.
sme: Ja mii leimmet dieđusge hui movttegat go viimmat dáid oaččuimet.

source: Internatskole for å bevare språket – en helt ny tanke
sme: Internáhttaskuvla giela seailluheami dihtii

source: Det var mange som mente at internatskole ikke er bra.
sme: Ollugat hupme ahte internáhttaskuvla ii leat buorre.

source: Også samer som sjøl hadde bodd på internat, motarbeida den nye internatskolen.
sme: Maiddái sápmelaččat mat ieža ledje orron internáhtas, vuosttildedje ođđa internáhttaskuvlla.

source: De mente at internatskole var fornorskende.
sme: Sis lei dakkár jurdda ahte internáhttaskuvla dáruiduhttá.

source: Men vi hadde det motsatte målet med denne skolen, nemlig å ta vare på det samiske og samisk språk.
sme: Muhto mis lei ulbmil áibbas nubbeládje dáinna skuvllain, namalassii váldit vára sámevuođas ja sámegielas.

source: – Når visste du helt sikkert at det kom til å bli bygget nye skolebygninger?
sme: – Goas dihtet don ahte duođaid šaddet ođđa skuvlavisttit?

source: – Det visste jeg ikke før i 1995, det var hele tiden treneringer, forsinkelser.
sme: – Na, dan in diehtán ovdal 1995:s, lei čađat dakkár cakkadeapmi, maŋideapmi.

source: Etter at det ble vedtatt at skolen skulle bygges, var prosjektet i Statsbyggs hender.
sme: Dan rájes go mearriduvvui ahte skuvla galggai huksejuvvot, de lei Statsbygg mii visot hálddašii.

source: Vi hadde selvsagt et utvalg som meldte inn behov, dette arbeidet begynte tidlig, alt da Biret Máret Kallio var rektor.
sme: Mis lei dieđusge lávdegoddi mii geahčai daid dárbbuid, dainna álggiimet hui árrat, dalle go Biret Máret Kallio lei rektor.

source: Ellers var skoledirektøren, Harry Kvalvik, veldig fin. Han har betydd mye for oss.
sme: Muđui lei skuvladirektevra, Harry Kvalvik, hui buorre olmmoš. Son lea hui olu mearkkašan midjiide.

source: Det var han som bevilga penger til å holde de første kursene, tilbake på 70-tallet.
sme: Son dat juolludii maid ruđaid daid vuosttamuš kurssaid doallat, dalle 70-logus juo.

source: – Du var styreleder under byggeprosessen.
sme: – Don ledjet stivrajođiheaddji dalle go skuvlavisttit huksejuvvojedje.

source: Det var ikke noen liten sak, dette her – det skulle bygges skole, internat, kjøkken og så videre?
sme: Ii lean mihkkege smávva áššiid dat – hukset skuvlla, internáhta, gievkkanviesu ja nu ain?

source: – Det var det jo ikke, først var det nå dette å få staten til å bevilge midlene.
sme: – Dat ii lean dieđusge, lei álggus dat ahte juolludeamit luovvanit stáhtas.

source: Det var selvsagt det som var den største jobben for styret.
sme: Dat lei dieđusge stivrra bealis stuorimus bargu.

source: Selve byggeprosessen var det vår daværende rektor, Bjarne Kollstrøm, som fulgte opp.
sme: Ieš huksenproseassas lei min dalá rektor, Bjarne Kollstrøm, mii olu čuovvulii.

source: Han var spesielt dyktig på dette.
sme: Son lei erenoamáš čeahppi das.

source: Derfor medførte ikke byggeprosessen noe særlig ekstraarbeid for meg som styreleder, Bjarne og Statsbygg tok seg av dette.
sme: Danin ii čuohcan munnje stivrajođiheaddjin nu olu dat huksenproseassa, Bjarne ja Statsbygg dat fuolahedje dan.

source: Velkommen til Sameskolen i Troms
sme: Bures boahttin Tromssa sámeskuvlii.

source: (Foto: Siri Broch Johansen)
sme: (Govva: Siri Broch Johansen)

source: Her kan samiskspråklige elever i Troms få hele sin 10-årige skole på samisk, fra start (Vuolga) til mål (Moalla)
sme: Dás sáhttet sámegielat oahppit Tromssa fylkkas oažžut ollislaš 10-jagi skuvlla sámegillii, vuolggas mollii.

source: – Internatskole nå til dags er ganske spesielt?
sme: – Internáhttaskuvla dán áigge lea viehka erenoamáš?

source: – Ja, skolen er veldig bra på den måten at det er en internatskole hvor alle snakker samisk.
sme: – Juo, skuvla lea hui buorre dán dáfus ahte lea internáhttaskuvla mas buohkat hupmet sámegiela.

source: Vi har hatt norsktalende elever som har vært her et halvt år.
sme: Mis leat leamaš dárogielat oahppit geat leat leamaš dáppe jahkebeale.

source: Når det ikke er for mange av dem på en gang, så lærer også de å snakke samisk godt i løpet av et halvt år.
sme: Go fal eai leat beare máŋggas oktanaga, de sii maid ohppet sámegiela hupmat čielgasit jahkebeales.

source: Jeg har tre barn, alle har gått på denne skolen.
sme: Mus leat golbma máná, buohkat leat dáppe vázzán.

source: Jeg tror at det er på grunn av denne skolen at vi har klart å holde på språket.
sme: Mun jáhkán dan ahte leat giela doalahan dán skuvlla geažil.

source: Jeg tror ikke vi hadde klart de hvis vi ikke hadde hatt denne skolen.
sme: Mun in jáhke mii livččiimet nagodan dan dahkat jus ii livčče dat skuvla.

source: Det er mange barn som har en norsktalende forelder, som har lært samisk godt ved å gå på denne skolen, de har ikke hatt et stødig språkgrunnlag når de kom hit.
sme: Leat ollu mánát gean nubbi váhnen lea dárogielat, mat leat dán skuvllas oahppan čielgasit sámegiela, sis ii lean giella nu nanus go bohte.

source: Og ellers er det også elever som har norsktalende foreldre, bare besteforeldrene er samisktalende.
sme: Ja muđui leat maid dakkárat main leat dárogielat váhnemat, sámegielat áhkut ja ádját dušše.

source: I så henseende har denne skolen betydd enormt mye.
sme: Dakko dáfus lea hirbmat olu mearkkašan dat skuvla.

source: Også for barn fra andre områder
sme: Eará guovllu mánáid várás maid

source: – Er dette er reindriftssamene i indre Troms sin skole?
sme: – Lea go nu ahte lea sis-Romssa badjeolbmuid skuvla?

source: – Nei, det er for mange andre også, spesielt de seinere årene.
sme: – Ii, dat lea ollu earáid várás maiddái, erenoamážit daid maŋimuš jagiid.

source: Det har vært elever også fra Lavangen kommune.
sme: Leat maid Loabága suohkanis leamaš oahppit.

source: Noen har slutta, andre går fortsatt her.
sme: Muhtumat leat heaitán, muhtumat ain vázzet dáppe.

source: De har bodd på internatet her, og de har lært mye samisk.
sme: Sii leat dáppe orron internáhtas, ja leat olu sámegiela oahppan.

source: Mange av nabobarna våre har lært så mye samisk at....
sme: Oallugat mu ránnjáid mánát leat oahppan sámegiela nu ahte...

source: det er veldig artig!
sme: lea hui somá!

source: Ellers ville de ikke lært så mye, i hvert fall.
sme: Muđui eai livčče várra máhttán nu olu, goit.

source: Jeg tror at et par timer samisk i uka ikke er nok til å lære språket.
sme: Mun jáhkán jus moadde diimmu sámegiela vahkus oažžu skuvllas, dat ii leat doarvái oahppat giela.

source: De lærer så fort her, for her er de i et samisktalende miljø døgnet rundt.
sme: Ohppet nu jođánit dás, gos leat birra jándoriid sámegiel birrasis.

source: Når det ikke er så mange slike elever her om gangen at norsk vinner, går det bra.
sme: Go dakkár oahppit eai leat nu oallugat ahte dárogiella vuoitá, de manná bures.

source: Kniv laga av eleven Nathaniel Holan Larsen i 6. klasse.
sme: Niibi maid 6. luohká oahppi Nathaniel Holan Larsen lea duddjon, 2012.

source: (Foto: Vibeke Larsen)
sme: Govva: Vibeke Larsen)

source: Bygd for samiske barn
sme: Huksejuvvon sámi mánáid várás

source: Det er mange bygninger rundt skoleplassen.
sme: Skuvlašiljus leat máŋgga vistti.

source: Selve skolebygningen har en fløy for administrasjonen, en fløy for klasserom som også inkluderer duodjiavdeling, og mellom dem er det gymnastikksal.
sme: Ieš skuvlavisttis lea hálddahusgeahči, luohkkálatnjageahči duodjeossodagain, ja daid gaskkas lášmmohallansále.

source: Det er også et eget kjøkkenhus, og internat som har barnehage i den ene enden.
sme: Lea maid sierra gievkkanvisti, ja internáhtta mas nubbi geahči lea dál mánáidgárdi.

source: I tillegg er det en gamme, en innhegning for rein, et stabbur, fotballbane og en liten akebakke.
sme: Dasa lassin lea goahti, gárdi, áiti, spáppačiekčanšillju ja smávva čierastanluohkká.

source: – Hva sier folk her i området til at det har blitt brukt så mye penger bare på dere?
sme: – Maid olbmot lohke muđui dáppe birrasis go ná olu ruđat geavahuvvojedje dušše din jovkui?

source: – Ja, jeg har nå vel hørt litt forskjellig, men jeg tror ikke at vi har tatt penger fra noen andre.
sme: – Na, lean mun gal dieđusge veahá gullan, muhto in jáhke mii leat earáin váldán ruđaid.

source: De pengene som er brukt på dette, ville ellers ikke kommet denne regionen til gode.
sme: Eai livčče muđui boahtán dat ruđat deike dán guvlui.

source: Og her er det også arbeidsplasser, og folk betaler skatt til kommunen.
sme: Ja dáppe han leat maiddái bargosajit, ja olbmot mákset vearu suohkanii.

source: Og hvis man ser helhetlig på det, så har mange berga språket sitt her.
sme: Ja jus obbalaččat geahččat, de lea olu olbmuid birgehan ahte eai leat massán gielaset.

source: – Hvordan tror du ting hadde vært nå hvis det aldri hadde kommet en egen skole?
sme: – Mo jáhkát livččii šaddan jus ii goassege livčče boahtán sierra skuvla?

source: Ville dere da ha sendt barna deres til Kautokeino på skole, eller..
sme: Livččiidet go dalle mánáid sádden Guovdageidnui, vai...

source: – Jeg tror ikke vi ville sendt dem så langt, det er alt for langt.
sme: – In mun jáhke mii livččiimet gillen daid nu guhkás sáddet, gal dat lea beare guhkás.

source: Slik som det er nå, så er man innen rekkevidde hvis barna ringer, man kan alltids kjøre til skolen og hente barna hvis de blir syke, eller hvis det er noe annet som skjer.
sme: Nu mo dál dás, de lea ain olahanmuttus jus mánná riŋge, de sáhttá vuojistit ja viežžalit máná jus buohccá dahje miige geavvá.

source: – Enn hvis det hadde vært sameskole og barna hadde bodd hjemme?
sme: – Naba jus livččii sámeskuvla ja mánát livčče orron ruovttus?

source: – Nå er det slik at de bor over et såpass stort områder, så de hadde ikke kunnet reise hit daglig.
sme: – Na, muhto dat orrot nu viidát, eai dat sáhtáše beaivválaččat johtit deike.

source: Det har vært elever her fra Skibotn, Ramfjord, Ballangen, Hinnøya og regionen ellers.
sme: Mánát leat leamaš gitta Ivgubađas, Gáranasvuonas, Bálágis, Iinnas ja muđui dás birrasiin.

source: Den eneste muligheten vi så var å samle dem. Både med det for øye at det skulle være mulig å finne lærere, og for å bygge opp et miljø hvor barna ikke bare får undervisning i samisk, men også på samisk.
sme: Áidna vejolašvuođa maid oinniimet lei mánáid čohkket. Sihke dan dáfus ahte oahpaheddjiid gávdnat, ja hukset birrasa mas mánát ožžot sihke sámegieloahpahusa ja oahpahusa sámegillii maid.

source: Anne Oskal Rørslett: Arbeidet går i arv
sme: Anne Oskal Rørslett: Árbebargu

source: Anne Oskal Rørslett (Foto: Siri Broch Johansen)
sme: Anne Oskal Rørslett (Govva: Siri Broch Johansen)

source: Anne Oskal Rørslett (f. 1946) har arbeidet ved sameskolen i Troms siden 1985.
sme: Anne Oskal Rørslett (r. 1946) lea bargan Tromssa sámeskuvllas 1985 rájes.

source: I begynnelsen jobba hun på internatet, så ble hun henta til skolen.
sme: Álggus barggai internáhtas, de vižžojuvvui skuvlii.

source: Hun tok allmenlærerutdanning i Tromsø 1991 samtidig som hun jobba som lærer.
sme: Gearggai Romssa oahpaheaddjiallaskuvllas 1991:s, seammás go barggai oahpaheaddjin.

source: Hun har også lest samisk grunnfag ved Samisk høgskole 1999.
sme: Lea maid lohkan sámegiela vuođđofága Sámi allaskuvllas 1999:s.

source: Hun jobba på sameskolen fram til hun gikk av med pensjon i 2011.
sme: Barggai sámeskuvllas gitta dassážii go bázii ealáhahkii 2011:s.

source: Rørslett har ellers arbeida med familiens reindrift, og hun er medeier og styreleder i bedrifta «Jienat AS».
sme: Rørslett lea muđui bargan bearraša boazodoalus, ja son lea fitnodaga «Jienat AS» mieleaiggát ja stivrajođiheaddji.

source: Hun er styreleder ved sameskolens barnehage.
sme: Lea sámeskuvlla mánáidgárddi stivrajođiheaddji.

source: Før hun begynte å jobbe ved sameskolen jobba hun mange år i Statens reindriftsadministrasjon både i Nordland og Troms, og deretter som sekretær i Troms reindriftssamers fylkeslag.
sme: Ovdal go bargagođii sámeskuvllas, de barggai máŋga jagi Boazodoallohálddahusas sihke Romssas ja Nordlánddas, ja dasto Romssa boazosápmelaččaid fylkasearvvi čállin.

source: Godt å komme i eget hus
sme: Buorre beassat iežamet dállui

source: – Du har jobba både ved skolen som var i leide lokaler på Haraldvollen, og på den nye skolen som ble bygget for dere.
sme: – Don leat bargan sihke boares skuvllas mii lei láigolanjain Haraldvollenis, ja ođđa skuvllas mii lei huksejuvvon din várás.

source: Hva var den største forskjellen i din arbeidshverdag på de to stedene?
sme: Mii lei stuorimus erohus maid vuhttet bargoárgabeaivvis?

source: – Ja, det var selvfølgelig dette å komme i eget hus, hvor man kunne bestemme sjøl.
sme: – Na, lei dieđusge dat ahte boahtit iežas vissui, gos ieš beassá mearridit.

source: Man trengte ikke lenger å spørre noen «kan jeg bruke dette rommet nå».
sme: Ii dárbbašan šat ii geasge jearrat «beasan go dán lanja atnit dál».

source: Og selvsagt dette at det endelig fantes rom som var tilpassa både duodji og annen undervisning.
sme: Ja de ledje dieđusge viimmat lanjat mat ledje heivehuvvon sihke duodjái ja oahpahussii.

source: På Haraldvollen var det verken grupperom, duodjirom eller naturfagrom. Reindriftsarbeid på skoleplassen
sme: Haraldvollenis eai lean lanjat mat heivejedje smávit joavkkuide, eai ge lean matge lanjat duodjái, luonddufágii jna.

source: – Her på vår egen skole har vi kunnet drive med reindriftsarbeid.
sme: Boazobargu skuvlašiljus – Dáppe iežamet skuvllas leat beassan bargat sámi bargguid.

source: Vi har en ordentlig gårdsplass.
sme: Mis lea albma šillju.

source: Her har vi temmet rein.
sme: Dáppe leat mii bohccuid dápman.

source: Barna har bygd en innhegning, og vi har temma rein her hvert år.
sme: Mánát leat ráhkadan gárddi, ja mii leat juohke jagi biebman bohccuid doppe.

source: Hver elev har hatt sin egen rein.
sme: Juohke máná nammii lea leamaš boazu.

source: De har leid dem, temma dem, og til slutt har de kjørt med dem. De har bundet dem sammen og kjørt i raide.
sme: Sii leat láiddadan daid, dápman daid, ja maŋimuš vuodján daiguin. Leat leŋgen daid ráidovuodjimii.
